app/controllers/config_items_controller.rb

  def index
    @config_items = ConfigItem.all
---
SELECT * FROM "config_items"

  def new
    @config_item = ConfigItem.new
    @config_groups = ConfigItem.find_all_by_parent_id nil
---
SELECT * FROM "config_items" WHERE ("config_items"."parent_id" IS NULL)

  def create
    @config_item = ConfigItem.new(params[:config_item])

    if @config_item.save
---
INSERT INTO "config_items" ("name", "description", "created_at", "updated_at", "configurable", "parent_id") VALUES('Samba Group', 'All Samba Related Config Items', '2009-04-23 06:28:59', '2009-04-23 06:28:59', 'f', NULL)

  def edit
    @config_item = ConfigItem.find(params[:id])
    @config_groups = ConfigItem.find_all_by_parent_id nil
---
SELECT * FROM "config_items" WHERE ("config_items"."id" = 1)
SELECT * FROM "config_items" WHERE ("config_items"."parent_id" IS NULL)

  def update
    @config_item = ConfigItem.find(params[:id])
    if @config_item.update_attributes(params[:config_item])
---
SELECT * FROM "config_items" WHERE ("config_items"."id" = 2)
UPDATE "config_items" SET "description" = 'All config items that are to the default added to all hosts', "updated_at" = '2009-04-24 04:16:37' WHERE "id" = 6

  def destroy
    @config_item = ConfigItem.find(params[:id])
    if request.delete?
      @config_item.destroy
---
SELECT * FROM "config_items" WHERE ("config_items"."id" = 7)
DELETE FROM "config_items" WHERE "id" = 7