app/controllers/hosts_controller.rb

  def index
    @hosts = Host.all
---
SELECT * FROM "hosts"

  def new
    @host = Host.new
    @config_groups = ConfigItem.find_all_by_parent_id nil

    @config_groups.each { |item|
      if item.name == 'defaults'
        @default_group = item
        @config_groups.delete(item)
        break
      end
    }
    if @default_group
      @default_items = ConfigItem.find_all_by_parent_id_and_configurable(@default_group.id, true)
    end
    @host_type_item = ConfigItem.find_by_name('host_type')
---
SELECT * FROM "config_items" WHERE (parent_id IS NULL AND name NOT IN ('defaults'))
SELECT * FROM "config_items"
SELECT * FROM "config_items" WHERE ("config_items"."parent_id" = 6 AND "config_items"."configurable" = 't')
SELECT * FROM "config_items" WHERE ("config_items"."name" = 'defaults') LIMIT 1

  def get_sub_form
    @config_items = ConfigItem.find_all_by_parent_id(params[:id])
---
SELECT * FROM "config_items" WHERE ("config_items"."parent_id" IS NULL)

  def create
    @host = Host.new(params[:host])

    if @host.save
      params[:config_item].each {|k,v|
        HostConfig.create(:host => @host, :config_item_id => k, :value => v)
      }
      HostConfig.create(:host => @host, :config_item => ConfigItem.find_by_name('status'), :value => 'new')
---
INSERT INTO "hosts" ("name", "created_at", "updated_at") VALUES('Test2', '2009-04-21 20:02:32', '2009-04-21 20:02:32')
INSERT INTO "host_configs" ("host_id", "config_item_id", "value", "created_at", "updated_at") VALUES(8, 2, '1.1.1.1', '2009-04-22 04:59:11', '2009-04-22 04:59:11')
SELECT * FROM "config_items" WHERE ("config_items"."name" = 'status') LIMIT 1

  def show
    @host = Host.find(params[:id])
---
SELECT * FROM "hosts" WHERE ("hosts"."id" = 1)

  def edit
    @host = Host.find(params[:id])
    @config_groups = ConfigItem.find(:all, :conditions => ["parent_id IS ? AND name NOT IN (?)", nil, 'defaults'])
    @host_configs = @host.find_host_configs_not_configurable
---
SELECT * FROM "hosts" WHERE ("hosts"."id" = 1)
SELECT * FROM "config_items" WHERE (parent_id IS NULL AND name NOT IN ('defaults'))
SELECT * FROM "host_configs" WHERE ("host_configs".host_id = 8)

  def update
    @host = Host.find(params[:id])
    if @host.update_attributes(params[:host])
      if params[:config_item]
        params[:config_item].each {|k,v|
          unless found = HostConfig.find_by_host_id_and_config_item_id(@host.id, k)
            HostConfig.create(:host => @host, :config_item_id => k, :value => v)
          else
            found.update_attributes!(:value => v)
          end
        }
      end
      host_config = {}
      params[:host_config].each {|k,v|
---
SELECT * FROM "hosts" WHERE ("hosts"."id" = 3)
UPDATE "hosts" SET "name" = 'test5', "updated_at" = '2009-04-21 22:34:32' WHERE "id" = 3
SELECT "host_configs".id FROM "host_configs" WHERE ("host_configs"."config_item_id" = 2 AND "host_configs".host_id = 19 AND "host_configs".id <> 57) LIMIT 1
INSERT INTO "host_configs" ("host_id", "config_item_id", "value", "created_at", "updated_at") VALUES(19, 10, 'Test', '2009-04-24 06:57:45', '2009-04-24 06:57:45')
UPDATE "host_configs" SET "value" = 'Pop.com1', "updated_at" = '2009-04-24 06:54:38' WHERE "id" = 58
SELECT * FROM "host_configs"

  def destroy
    @host = Host.find(params[:id])
    if request.delete?
      @host.destroy
---
SELECT * FROM "hosts" WHERE ("hosts"."id" = 1)
DELETE FROM "hosts" WHERE "id" = 1

  def disable
    @host = Host.find(params[:id])
---
SELECT * FROM "hosts" WHERE ("hosts"."id" = 1)

  def enable
    @host = Host.find(params[:id])
---
SELECT * FROM "hosts" WHERE ("hosts"."id" = 1)