app/controllers/hosts_controller.rb

SELECT * FROM "config_items" WHERE ("config_items"."configurable" = 't')
---
  def new
    @host = Host.new
    @config_items = ConfigItem.find_all_by_configurable true