app/controllers/hosts_controller.rb

  def edit
    @host = Host.find(params[:id])
    @config_groups = ConfigItem.find(:all, :conditions => ["parent_id IS ? AND name NOT IN (?)", nil, 'defaults'])
    @host_configs = @host.find_host_configs_configurable
    @host_type = @host.find_host_config_by_name('host_type')
    if @host_type
      @host_type_children = ConfigItem.find_all_by_parent_id @host_type.config_item_id
      @host_type_current = ConfigItem.find @host_type.value.to_i
---
SELECT * FROM "config_items"
SELECT * FROM "host_configs" WHERE ("host_configs"."config_item_id" = 8) AND ("host_configs".host_id = 12) LIMIT 1