app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "login", "crypted_password", "password_salt", "persistence_token", "first_name", "last_name", "email", "login_count", "last_request_at", "last_login_at", "current_login_at", "last_login_ip", "current_login_ip") VALUES('2009-04-21 03:51:08', '2009-04-21 03:51:08', 'ballen', '8c3d9f033106af7b8b67f4a472cc8d32e0dacd25a54b44b5fc125f8ccfb89091b903fd9200bfe176a365c3f9ca7d162a33776f82d9de45964c17f8dc1f901e9e', 'l3w6vbZKKwtmnp5kwWXG', 'e9fbbe6a94bc7ac6a3cb353f90209fb9ebe75e5e793226125138290e46b6482dc5e8dd2f7983b6eb928452551c590c587f48fef2e8e96967f8664cc4f5215161', 'Ben', 'Allen', 'ben@asdf.com', 1, '2009-04-21 03:51:08', NULL, '2009-04-21 03:51:08', NULL, '127.0.0.1')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def show
    if params[:id]
      @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def edit
    if params[:id]
      @user = User.find(params[:id])